Revit 2026 API

# PolymeshTopology Class

---

A class representing topology of a polymesh.

SystemObject Autodesk.Revit.DBPolymeshTopology

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PolymeshTopology : IDisposable
```
```vb
Public Class PolymeshTopology
	Implements IDisposable
```
```cpp
public ref class PolymeshTopology : IDisposable
```
```fsharp
type PolymeshTopology =
    class
        interface IDisposable
    end
```

The PolymeshTopology type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DistributionOfNormals | Indicates the distribution of normal vectors along the tessellated polymesh surface. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfFacets | The number of facet in the polymesh. |
|  | NumberOfNormals | The number of normals associated with the polymesh |
|  | NumberOfPoints | The number of points in the polymesh |
|  | NumberOfUVs | The number of UV coordinates available for the polymesh. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PolymeshTopology |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFacet | Returns a definition of one facet |
|  | GetFacets | Returns a definitions of all facets of the polymesh |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetNormal | Returns a normal vector at the given index |
|  | GetNormals | Returns all normals assigned to the polymesh |
|  | GetPoint | Returns one point at the given index. |
|  | GetPoints | Returns all points of the polymesh. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUV | Returns one UV coordinate at the given index. |
|  | GetUVs | Returns all UV coordinates assigned to the polymesh |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Topology of a polymesh consists of a number of points and triangular facets formed by the points. Each facet is determined by three indices to the array of points. A polymesh may have UV coordinates assigned, and always has at least one normal associated. There may be more than one normal available for a non-planar polymesh; there may be as many normals as there are either facets or points in the polymesh. The DistributionOfNormals property indicates how normals are distributed along the polymesh.

#### Reference

Autodesk.Revit.DB Namespace